Revit 2026 API

# FamilyInstanceGetSubComponentIds Method

---

Gets the sub component ElementIds of the current family instance.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ICollection<ElementId> GetSubComponentIds()
```
```vb
Public Function GetSubComponentIds As ICollection(Of ElementId)
```
```cpp
public:
ICollection<ElementId^>^ GetSubComponentIds()
```
```fsharp
member GetSubComponentIds : unit -> ICollection<ElementId>
```

#### Return Value

ICollectionElementIdThe subcomponent ElementIDs

#### Reference

FamilyInstance Class

Autodesk.Revit.DB Namespace